In [1]:
import pandas as pd
import numpy as np

In [ ]:
#1차원 list 를 dataframe으로 변환
list = [1,2,3,4,5]
df1 = pd.DataFrame(list)
print(type(df1))
print(df1)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
df1["1열"] = list
df1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [7]:
df1.columns

Index([0, '1열'], dtype='object')

In [8]:
df2 = df1.rename(columns={0:'0열'})
df2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [12]:
#2차원 배열을 데이터프레임으로 만들기
score = [
    ['정약용', 70, 80, 100],
    ['이순신', 90, 80, 60],
    ['이율곡', 50, 100, 100]
    ]

print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 90, 80, 60], ['이율곡', 50, 100, 100]]

In [14]:
df3 = pd.DataFrame(score)
print(type(df3))
df3

<class 'pandas.core.frame.DataFrame'>

     0   1    2    3
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100

In [ ]:
df3.columns = ["이름", "국어", "영어", "수학"]
print(df3)
print(df3.shape)
print(df3.index)

    이름  국어   영어   수학
0  정약용  70   80  100
1  이순신  90   80   60
2  이율곡  50  100  100
(3, 4)
RangeIndex(start=0, stop=3, step=1)

In [20]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [22]:
df3.describe()

         국어          영어          수학
count   3.0    3.000000    3.000000
mean   70.0   86.666667   86.666667
std    20.0   11.547005   23.094011
min    50.0   80.000000   60.000000
25%    60.0   80.000000   80.000000
50%    70.0   80.000000  100.000000
75%    80.0   90.000000  100.000000
max    90.0  100.000000  100.000000

In [ ]:
# dictionary 데이터 프레이임으로 전환
# dic1 = {
#     'col1':[1,2,3,4],
#     'col2':[5,6,7,8]
# }
# n= pd.DataFrame(dic1)

n = pd.DataFrame({
    'col1':['1','2','3','4'],
    'col2':[5,6,7,8]
})
print(n)

  col1  col2
0    1     5
1    2     6
2    3     7
3    4     8

In [ ]:
n.info()
n.dtypes
# 숫자 column만 통계자료 생성됨
n.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

           col2
count  4.000000
mean   6.500000
std    1.290994
min    5.000000
25%    5.750000
50%    6.500000
75%    7.250000
max    8.000000

In [35]:
#데이터 type변경 (String -> int), (int -> float)
n_df = n.astype({'col1':int, 'col2':float})
n_df.dtypes
#컬럼을 숫자type으로 변경시 통계자료 생성됨
n_df.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000

In [44]:
#전체컬럼조회
display(n_df)
#컬럼값1개는 대괄호가 1개 필요
display(n_df['col1'])
#컬럼값2개 이상에는 대괄호가 2개 필요
display(n_df[['col1','col2']])

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

In [47]:
# 순회해서 데이터 접근하기 : iteration rows : row 순회함수
for index, row in n_df.iterrows():
    print(row['col1'])

1.0
2.0
3.0
4.0

In [51]:
# 새로운 컬럼을 추가해서 sum값 만들기
n_df
n_df['sum'] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [54]:
# 8이상인sum값 구하기
n1_df = n_df[n_df['sum']>= 8]

In [ ]:
# index가 빠진상태로  들어간다
n1_df

   col1  col2   sum
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [66]:
# index 초기화 : 원래 인덱스는 남고, 새로운 초기화된 index 생성됨
n1_df.reset_index()
n1_sum = n1_df['sum']
print(type(n1_sum))
print(n1_sum.shape)
print(n1_sum)

<class 'pandas.core.series.Series'>
(3,)
1     8.0
2    10.0
3    12.0
Name: sum, dtype: float64

In [ ]:
# index를 초기화하는 다른방법 : drop=True : 예전 index는 사라지고 새로운 인덱스 생김
n2_df = n_df[n_df['sum']>= 8].reset_index(drop=True)

In [59]:
n2_df

   col1  col2   sum
0     2   6.0   8.0
1     3   7.0  10.0
2     4   8.0  12.0

In [1]:
# 타이타닉 통계
import pandas as pd

titanic_df = pd.read_csv('data/titanic.csv')

titanic_df
titanic_df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [3]:
titanic_df.sort_values(ascending=False, by='age')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [4]:
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64